In [1]:
import pandas as pd

In [39]:
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }

In [31]:
# print(dict.country = "Brazil")

In [42]:
print(dict["country"][1][0])

R

In [46]:
sorteda = dict["population"]

In [53]:
print(sorteda.sort())

None

In [50]:
print(a)

None

In [56]:
dataframe = pd.DataFrame(dict)

In [57]:
dataframe

        country    capital    area  population
0        Brazil   Brasilia   8.516       52.98
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286      200.40
3         China    Beijing   9.597     1252.00
4  South Africa   Pretoria   1.221     1357.00

In [59]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

In [60]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [97]:
grouped = df.groupby(['Team'])

In [95]:
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002588C9AA2E8>

      0                                                  1
0  2014       Team  Rank  Year  Points
0  Riders     1 ...
1  2015        Team  Rank  Year  Points
1   Riders     ...
2  2016       Team  Rank  Year  Points
6   Kings     1 ...
3  2017        Team  Rank  Year  Points
7    Kings     ...

In [98]:
for Year,Group in grouped:
    print(Year)
    print(Group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [99]:
print(df.groupby('Team').filter(lambda x: len(x) >= 3))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690